interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoStringArray-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoStringArray soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputStringArray soapenc:itemType="xsd:string" soapenc:arraySize="3" xsi:type="soapenc:Array" xmlns:soapenc="http://www.w3.org/2003/05/soap-encoding">
            <inputStringArray xsi:type="xsd:string">1.1F</inputStringArray>
            <inputStringArray xsi:type="xsd:string">1.2F</inputStringArray>
            <inputStringArray xsi:type="xsd:string">1.3F</inputStringArray>
         </inputStringArray>
      </ns1:echoStringArray>
   </soapenv:Body>
</soapenv:Envelope>